-------------------------------------------------- RUN FOLD _OS_resample --------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1      [-1, 64, 100, 50, 50]          65,856
       BatchNorm3d-2      [-1, 64, 100, 50, 50]             128
              ReLU-3      [-1, 64, 100, 50, 50]               0
         MaxPool3d-4       [-1, 64, 50, 25, 25]               0
            Conv3d-5       [-1, 64, 50, 25, 25]         110,592
       BatchNorm3d-6       [-1, 64, 50, 25, 25]             128
              ReLU-7       [-1, 64, 50, 25, 25]               0
            Conv3d-8       [-1, 64, 50, 25, 25]         110,592
       BatchNorm3d-9       [-1, 64, 50, 25, 25]             128
             ReLU-10       [-1, 64, 50, 25, 25]               0
       BasicBlock-11       [-1, 64, 50, 25, 25]               0
           Conv3d-12       [-1, 64, 50, 25, 25]         110,592
      BatchNorm3d-13       [-1, 64, 50, 25, 25]             128
             ReLU-14       [-1, 64, 50, 25, 25]               0
           Conv3d-15       [-1, 64, 50, 25, 25]         110,592
      BatchNorm3d-16       [-1, 64, 50, 25, 25]             128
             ReLU-17       [-1, 64, 50, 25, 25]               0
       BasicBlock-18       [-1, 64, 50, 25, 25]               0
           Conv3d-19      [-1, 128, 25, 13, 13]         221,184
      BatchNorm3d-20      [-1, 128, 25, 13, 13]             256
             ReLU-21      [-1, 128, 25, 13, 13]               0
           Conv3d-22      [-1, 128, 25, 13, 13]         442,368
      BatchNorm3d-23      [-1, 128, 25, 13, 13]             256
           Conv3d-24      [-1, 128, 25, 13, 13]           8,192
      BatchNorm3d-25      [-1, 128, 25, 13, 13]             256
             ReLU-26      [-1, 128, 25, 13, 13]               0
       BasicBlock-27      [-1, 128, 25, 13, 13]               0
           Conv3d-28      [-1, 128, 25, 13, 13]         442,368
      BatchNorm3d-29      [-1, 128, 25, 13, 13]             256
             ReLU-30      [-1, 128, 25, 13, 13]               0
           Conv3d-31      [-1, 128, 25, 13, 13]         442,368
      BatchNorm3d-32      [-1, 128, 25, 13, 13]             256
             ReLU-33      [-1, 128, 25, 13, 13]               0
       BasicBlock-34      [-1, 128, 25, 13, 13]               0
           Conv3d-35        [-1, 256, 13, 7, 7]         884,736
      BatchNorm3d-36        [-1, 256, 13, 7, 7]             512
             ReLU-37        [-1, 256, 13, 7, 7]               0
           Conv3d-38        [-1, 256, 13, 7, 7]       1,769,472
      BatchNorm3d-39        [-1, 256, 13, 7, 7]             512
           Conv3d-40        [-1, 256, 13, 7, 7]          32,768
      BatchNorm3d-41        [-1, 256, 13, 7, 7]             512
             ReLU-42        [-1, 256, 13, 7, 7]               0
       BasicBlock-43        [-1, 256, 13, 7, 7]               0
           Conv3d-44        [-1, 256, 13, 7, 7]       1,769,472
      BatchNorm3d-45        [-1, 256, 13, 7, 7]             512
             ReLU-46        [-1, 256, 13, 7, 7]               0
           Conv3d-47        [-1, 256, 13, 7, 7]       1,769,472
      BatchNorm3d-48        [-1, 256, 13, 7, 7]             512
             ReLU-49        [-1, 256, 13, 7, 7]               0
       BasicBlock-50        [-1, 256, 13, 7, 7]               0
           Conv3d-51         [-1, 512, 7, 4, 4]       3,538,944
      BatchNorm3d-52         [-1, 512, 7, 4, 4]           1,024
             ReLU-53         [-1, 512, 7, 4, 4]               0
           Conv3d-54         [-1, 512, 7, 4, 4]       7,077,888
      BatchNorm3d-55         [-1, 512, 7, 4, 4]           1,024
           Conv3d-56         [-1, 512, 7, 4, 4]         131,072
      BatchNorm3d-57         [-1, 512, 7, 4, 4]           1,024
             ReLU-58         [-1, 512, 7, 4, 4]               0
       BasicBlock-59         [-1, 512, 7, 4, 4]               0
           Conv3d-60         [-1, 512, 7, 4, 4]       7,077,888
      BatchNorm3d-61         [-1, 512, 7, 4, 4]           1,024
             ReLU-62         [-1, 512, 7, 4, 4]               0
           Conv3d-63         [-1, 512, 7, 4, 4]       7,077,888
      BatchNorm3d-64         [-1, 512, 7, 4, 4]           1,024
             ReLU-65         [-1, 512, 7, 4, 4]               0
       BasicBlock-66         [-1, 512, 7, 4, 4]               0
        AvgPool3d-67         [-1, 512, 1, 1, 1]               0
           Linear-68                    [-1, 2]           1,026
          Softmax-69                    [-1, 2]               0
           ResNet-70                    [-1, 2]               0
================================================================
Total params: 33,204,930
Trainable params: 33,204,930
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 11.44
Forward/backward pass size (MB): 688.02
Params size (MB): 126.67
Estimated Total Size (MB): 826.13
----------------------------------------------------------------
